

bac_spec_b_header = [
    {'name': ['', 'Код'], 'id': 'spec_code'},
    {'name': ['', 'Направление подготовки'], 'id': 'spec_name'},
    {'name': ['', 'Заявлений всего'], 'id': 'all_application'},
    {'name': ['', 'Средний балл'], 'id': 'mean_bal'},
    {'name': ['Оригинал документа об образовании (в скобках КЦП)', 'Всего'], 'id': 'orig_all'},
    {'name': ['Оригинал документа об образовании (в скобках КЦП)', 'Основные места'], 'id': 'orig_osn'},
    {'name': ['Оригинал документа об образовании (в скобках КЦП)', 'Целевая квота'], 'id': 'orig_cel'},
    {'name': ['Оригинал документа об образовании (в скобках КЦП)', 'Особая квота'], 'id': 'orig_os'},
    {'name': ['Оригинал документа об образовании (в скобках КЦП)', 'Специальная квота'], 'id': 'orig_spec'},
]

bac_spec_k_header = [
    {'name': ['', 'Код'], 'id': 'spec_code'},
    {'name': ['', 'Направление подготовки'], 'id': 'spec_name'},
    {'name': ['', 'Заявлений всего'], 'id': 'all_application'},
    {'name': ['', 'Средний балл'], 'id': 'mean_bal'},
    {'name': ['Оригинал документа об образовании (в скобках места по Доу)', 'Всего'], 'id': 'orig_all'},
]

mag_b_header = [
    {'name': ['', 'Код'], 'id': 'spec_code'},
    {'name': ['', 'Профиль магистратуры'], 'id': 'spec_name'},
    {'name': ['', 'Заявлений всего'], 'id': 'all_application'},
    {'name': ['', 'Средний балл'], 'id': 'mean_bal'},
    {'name': ['Оригинал документа об образовании (в скобках КЦП)', 'Всего'], 'id': 'orig_all'},
    {'name': ['Оригинал документа об образовании (в скобках КЦП)', 'Основные места'], 'id': 'orig_osn'},
    {'name': ['Оригинал документа об образовании (в скобках КЦП)', 'Целевая квота'], 'id': 'orig_cel'},
]

mag_k_header = [
    {'name': ['', 'Код'], 'id': 'spec_code'},
    {'name': ['', 'Профиль магистратуры'], 'id': 'spec_name'},
    {'name': ['', 'Заявлений всего'], 'id': 'all_application'},
    {'name': ['', 'Средний балл'], 'id': 'mean_bal'},
    {'name': ['Оригинал документа об образовании (в скобках места по ДОУ)', 'Всего'], 'id': 'orig_all'},
]

